#language: ru
@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: Заполнение шапки документа Заказ

Сценарий: Заполнение шапки документа Заказ

И из выпадающего списка с именем 'Организация' я выбираю точное значение 'ООО "Товары"'
И из выпадающего списка с именем 'Покупатель' я выбираю точное значение "Животноводство ООО "
И из выпадающего списка с именем 'Склад' я выбираю точное значение "Средний"
И из выпадающего списка с именем 'ВидЦен' я выбираю точное значение "Оптовая"
И из выпадающего списка с именем 'Валюта' я выбираю точное значение "Рубли"


